src/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугиБезСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугиПоСогласованию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УслугиПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласование</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСогласованийУслугСтраховойКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПриПревышении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграничениеЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗубов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВПриеме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СтатусыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСогласованийУслугСтраховойКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСогласованийУслугСтраховойКомпании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПревышении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПолисыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПолисыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПолиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаПрикрепления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПрограммыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКратко</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаБелый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтраховыхДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если Параметры.Свойство("Контрагент") Тогда
		Объект.Контрагент = Параметры.Контрагент; 
	КонецЕсли;
	
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаДоговора = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Формирует переключатель закладок
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("ОтборНоменклатуры"	, "ГруппаОтборНоменклатуры");
	СтруктураМеню.Вставить("ОграничениеЗубов"	, "ГруппаОграничениеЗубов");
	
	Если Объект.Ссылка.Пустая() = Ложь Тогда
		СтруктураМеню.Вставить("ОтборПолисы"		, "ГруппаПолисы");		
		ЭтотОбъект.Полисы.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);	
	КонецЕсли;
	Если Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания Тогда 	
		ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	КонецЕсли;
	УстановитьВидимостьИЗаголовки();
	ЭтаФорма.ОснованаяКопияСсылка = ?(ЗначениеЗаполнено(Параметры.ЗначениеКопирования), Параметры.ЗначениеКопирования, Неопределено);
	ЗаполнитьДерево(ОснованаяКопияСсылка);
	ЗаполнитьДеревоНоменклатур(ОснованаяКопияСсылка);
	УстановитьНачальныеФлагиНаГруппы();
	УстановитьДоступностьДобавленияУслугНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьФильтр();
	УстановитьВидимостьМеток();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СтрШаблон(НСтр("ru = 'Договор № %1 от %2 c %3'"),
		СокрЛП(Объект.НомерДоговора),
		СокрЛП(Строка(Формат(Объект.ДатаДоговора, "ДФ=dd.MM.yyyy"))), 
		СокрЛП(Объект.Контрагент)); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
// Процедура, обработчик события формы "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДеревоВТаблицу(ТекущийОбъект);
	
	// Проверка на заполненность "При превышении" в необходимых строках	
	МассивСтрокиСПревышением = ТекущийОбъект.УслугиПоДоговору.НайтиСтроки(Новый Структура("Согласование, КоличествоПриПревышении", Перечисления.ТипыСогласованийУслугСтраховойКомпании.ПриПревышении, 0));
	Для Каждого ПроверяемаяСтрока Из МассивСтрокиСПревышением Цикл	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено количество при превышении в строке с номенклатурой: " + ПроверяемаяСтрока.Номенклатура);
		Отказ = Истина; 
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьИнформациюОДоговорах", Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события элемента формы "ПриИзменении".
//
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьВидимостьИЗаголовки();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия на переключатель закладок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	//Если ДОДокументИзменен И Элемент.Имя = "_ГруппаОбследование" Тогда
	//	ПередЗаписьюПроверитьЗаполнениеДанныхОбследования();
	//КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	//УстановитьОтображениеЭлементовПереключателя(Элемент.Имя);
	//
	//Если Элемент.Имя = "_ГруппаЗапасы" 
	//	Или Элемент.Имя = "_ГруппаЛечение" Тогда
	//	
	//	ОбновитьПоборНаСервере(Элемент.Имя);
	//
	//КонецЕсли;
	
	//Если ЗначениеЗаполнено(ПринудительноеОбновлениеТаблицыПодбора) Тогда	
	//	
	//	ИзменитьСортировкуПодбора(ЭтотОбъект[ПринудительноеОбновлениеТаблицыПодбора], "Наименование", ПолучитьТекущийПорядокСортировкиПодбора(ЭтотОбъект[ПринудительноеОбновлениеТаблицыПодбора]));							
	//	Элементы[ПринудительноеОбновлениеТаблицыПодбора].Обновить();
	//	ПринудительноеОбновлениеТаблицыПодбора = Неопределено;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ФильтрПриИзменении(Элемент)
	
	УстановитьФильтр();
	Если Фильтр = 1 Тогда
		ДанныеДерева = ЭтаФорма.ДеревоНоменклатур.ПолучитьЭлементы(); 
		Если ДанныеДерева.Количество() > 0 Тогда
			Элементы.ДеревоНоменклатур.ТекущаяСтрока = 0; 
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Дерево номенклатур выбран при изменении.
//
Процедура ДеревоНоменклатурВыбранПриИзменении(Элемент)
	
	ИмяКолонки 	  = Элемент.Имя;
	ТекущиеДанные = Элементы.ДеревоНоменклатур.ТекущиеДанные;
	МассивНоменклатурИсключений = ПолучитьСписокНоменклатурыОрганичений();
	
	Если ТекущиеДанные.ЭтоГруппа Тогда  
		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли;
		
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки, МассивНоменклатурИсключений);
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, Истина);
		
	Иначе
		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			
			НайденнаяНоменклатура = МассивНоменклатурИсключений.Найти(ТекущиеДанные.Номенклатура);
			Если НайденнаяНоменклатура = Неопределено Тогда
				ТекущиеДанные[ИмяКолонки] = 0;
				УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки);
			Иначе 
				ТекущиеДанные[ИмяКолонки] = 1; // требуется, т.к. автоматически меняется на 1.
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Удалите услугу: %1 из дерева ограничений", ТекущиеДанные.Номенклатура));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события дерева формы "ПриИзменении".
//
Процедура ДеревоНоменклатурПриИзменении(Элемент)
	 ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события дерева формы "ПриИзменении".
//
Процедура ДеревоУслугСогласованиеПриИзменении(Элемент)
	
	Если Элементы.ДеревоУслуг.ТекущиеДанные <> Неопределено
		И Элементы.ДеревоУслуг.ТекущиеДанные.Согласование <> ПредопределенноеЗначение("Перечисление.ТипыСогласованийУслугСтраховойКомпании.ПриПревышении") Тогда
		Элементы.ДеревоУслуг.ТекущиеДанные.КоличествоПриПревышении = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоУслуг

&НаКлиенте
// Процедура, обработчик события дерева формы "ПриИзменении".
//
Процедура ДеревоУслугПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина; 
	УстановитьДоступностьДобавленияУслугНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события дерева формы "ДеревоУслугВыбор".
//
Процедура ДеревоУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если Элемент.ТекущиеДанные.Номенклатура = Неопределено
			ИЛИ ТипЗнч(Элемент.ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда 
			
			Если Поле.Имя = "ДеревоУслугНоменклатура" Тогда
				ПоказатьЗначение(,Элемент.ТекущиеДанные.Номенклатура);
			КонецЕсли;
			СтандартнаяОбработка = Истина;
			
		Иначе
			
			ПараметрыЗубов = Новый Структура(); 
			ПараметрыЗубов.Вставить("НаименованиеОграничения", Элемент.ТекущиеДанные.НаименованиеОграничения);
			ПараметрыЗубов.Вставить("КлючСтроки", 		Элемент.ТекущиеДанные.КлючСтрокиОграничениеЗубов);
			ПараметрыЗубов.Вставить("КоличествоЗубов", 	Элемент.ТекущиеДанные.КоличествоЗубов);
			ПараметрыЗубов.Вставить("КоличествоВПриеме",Элемент.ТекущиеДанные.КоличествоВПриеме);
			ПараметрыЗубов.Вставить("Согласование",		Элемент.ТекущиеДанные.Согласование);
			
			Оповещение = Новый ОписаниеОповещения("ДобавитьОграничениеЗубовНаСервереЗавершение", ЭтотОбъект);
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаОграниченияЗубов", ПараметрыЗубов,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события дерева формы "ДеревоУслугПередНачаломДобавления".
//
Процедура ДеревоУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И (Элемент.ТекущиеДанные.Номенклатура = Неопределено
		ИЛИ ТипЗнч(Элемент.ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.Номенклатура"))  Тогда
		
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды формы "СкопироватьТЧИзДругогоДокумента".
//
Процедура СкопироватьТЧИзДругогоДокумента(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборДоговораДляКопированияОбработкаВыбора", ЭтотОбъект);		
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора",,,,,,
	ОповещениеОЗакрытии, 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ДобавитьОграничениеЗубов".
//
Процедура ДобавитьОграничениеЗубов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьОграничениеЗубовНаСервереЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаОграниченияЗубов",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ДобавитьВДеревоУслуг".
//
Процедура ДобавитьВДеревоУслуг(Команда)
		
	МассивВыбранныхНоменклатур = ПолучитьМассивВыбранныхНоменклатур();
	
	СтруктураПараметры = Новый Структура();	
	СтруктураПараметры.Вставить("МножественныйВыбор"          	, Истина);
	СтруктураПараметры.Вставить("МассивНоменклатур" 			, МассивВыбранныхНоменклатур);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоУслугиНоменклатураНачалоВыбораЗавершение", ЭтаФорма, МассивВыбранныхНоменклатур); 	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", СтруктураПараметры, ЭтаФорма,,,, 
	ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
// Функция, возвращает массив выбранных номенклатур из табличной части услуги.
//
Функция ПолучитьМассивВыбранныхНоменклатур()
	
	МассивВыбранныхНоменклатур = Новый Массив();
	ПервичныйМассив = ВыгрузитьДеревоЗначенийВТаблицу(РеквизитФормыВЗначение("ДеревоНоменклатур"), Ложь).НайтиСтроки(Новый Структура("Выбран", 1));
	
	ДеревоЗначенийУслуг = РеквизитФормыВЗначение("ДеревоУслуг");
	Для каждого СтрокаМассива Из ПервичныйМассив Цикл
		
		МассивНайденныхСтрок = ДеревоЗначенийУслуг.Строки.НайтиСтроки(Новый Структура("Номенклатура",СтрокаМассива.Номенклатура), Истина);
		Если МассивНайденныхСтрок.Количество() = 0 Тогда
			МассивВыбранныхНоменклатур.Добавить(СтрокаМассива.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивВыбранныхНоменклатур;

КонецФункции

&НаКлиенте
// Процедура, выбрать все строки.
//
Процедура ВыбратьСтроки(Команда)
	
	ОтметитьУслуги(1);
	
КонецПроцедуры

&НаКлиенте
// Процедура, исключить все строки.
//
Процедура ИсключитьСтроки(Команда)
		
	//ИсключитьСтрокиНаСервере();
	
	МассивНоменклатур = Новый Массив();
	ДеревоУслугОграниченийГрупа = ДеревоУслуг.ПолучитьЭлементы();
	Для каждого СтрокаДереваГруппа Из ДеревоУслугОграниченийГрупа Цикл
		// Вложенность только 1.
		ДанныеДереваЭлементы = СтрокаДереваГруппа.ПолучитьЭлементы();
		Для каждого ЭлементДерева Из ДанныеДереваЭлементы Цикл
			МассивНоменклатур.Добавить(ЭлементДерева.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
	ОтметитьУслуги(0, МассивНоменклатур);
	ЭтаФорма.Модифицированность = Истина;
	УстановитьНачальныеФлагиНаГруппы();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ИмпортСтраховыхПациентов".
//
Процедура ИмпортСтраховыхПациентов(Команда)
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("СтраховаяКомпания", Объект.Контрагент);
	ПараметрыЗаполнения.Вставить("ДоговорСтраховойКомпании", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.ИмпортСтраховыхПациентов.Форма", ПараметрыЗаполнения, ЭтаФорма,Ложь,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ДобавитьПолис".
//
Процедура ДобавитьПолис(Команда)
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("СтраховаяКомпания", Объект.Контрагент);
	
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.Форма.ФормаЭлемента", СтруктураЗаполнения,ЭтаФорма,Ложь,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Установить видимость и заголовки.
//
Процедура УстановитьВидимостьИЗаголовки()
	
	//Элементы.УслугиБезСогласования.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
	//	И Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания; 
	//Элементы.УслугиПоСогласованию.Видимость = Элементы.УслугиБезСогласования.Видимость;
	
	ТипКонтрагента = Объект.Контрагент.ТипКонтрагента;
	
	Элементы.ГруппаСтраховойКомпании.Видимость = (ЗначениеЗаполнено(Объект.Контрагент) 
	И ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания);
	
	Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания Тогда
		СтрокаТипКонтрагента = "страховой компанией";
		ЗаголовокЭлементаКонтрагенты = "Страховая компания";
	ИначеЕсли ТипКонтрагента = Перечисления.ТипыКонтрагентов.Поставщик Тогда
		СтрокаТипКонтрагента = "поставщиком";
		ЗаголовокЭлементаКонтрагенты = "Поставщик";
	ИначеЕсли ТипКонтрагента = Перечисления.ТипыКонтрагентов.Лаборатория Тогда
		СтрокаТипКонтрагента = "лабораторией";
		ЗаголовокЭлементаКонтрагенты = "Лаборатория";
	Иначе
		СтрокаТипКонтрагента = "контрагентом";
		ЗаголовокЭлементаКонтрагенты = "Контрагент";
	КонецЕсли;	

	Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания И ЗначениеЗаполнено(Объект.Контрагент.КраткоеНаименование) Тогда
		Элементы.ГруппаАльфа.Видимость = Истина;
		ФонМетки = ?(ЗначениеЗаполнено(Объект.Контрагент.ЦветФонаМетки), ЗначениеИзСтрокиВнутр(Объект.Контрагент.ЦветФонаМетки), WebЦвета.СеребристоСерый); 
		Элементы.ДекорацияАльфа.ЦветТекста  = ?(Объект.Контрагент.ЦветТекстаБелый, Новый Цвет(255,255,255), Новый Цвет(77,77,77));
		Элементы.ДекорацияАльфа.Заголовок	= Объект.Контрагент.КраткоеНаименование;
		Элементы.ГруппаАльфа.ЦветФона  = ФонМетки; 
	Иначе
		Элементы.ГруппаАльфа.Видимость = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Договор с "+ СтрокаТипКонтрагента;
	Элементы.Контрагент.Заголовок = ЗаголовокЭлементаКонтрагенты; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор договора для копирования обработка выбора.
//
Процедура ВыборДоговораДляКопированияОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.УслугиПоДоговору.Количество() > 0 Тогда
		ПараметрыВопроса = Новый Структура("РезультатВыбора", Результат);
		Оповещение = Новый ОписаниеОповещения("КопированиеТЧЗавершение", ЭтотОбъект, ПараметрыВопроса); 
		ПоказатьВопрос(Оповещение, "Табличная часть с номенклатурой будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);	
	Иначе
		ЗаполнитьСтрокиИзНовойТаблицыПоДоговору(Результат)	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Копирование ТЧЗавершение.
//
Процедура КопированиеТЧЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСтрокиИзНовойТаблицыПоДоговору(Параметры.РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить строки из новой таблицы по договору.
//
Процедура ЗаполнитьСтрокиИзНовойТаблицыПоДоговору(Договор)
	
	ЗаполнитьДерево(Договор);
	
КонецПроцедуры

&НаСервере
// Функция - Получить список номенклатуры из папки.
//
Функция ПолучитьСписокНоменклатурыИзПапки(Папка)
	
	Если НЕ Папка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат Новый Массив;	
	КонецЕсли;
	
	Таблица = Справочники.Номенклатура.ПолучитьНоменклатуруПоГруппе(Папка);
	Возврат ?(ЗначениеЗаполнено(Таблица), Таблица.ВыгрузитьКолонку("Ссылка"), Новый Массив);
	
КонецФункции

&НаСервере
// Процедура - заполняет дерево значений формы из данных.
//
Процедура ЗаполнитьДерево(Договор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки КАК КлючСтроки,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ПО ДоговорыКонтрагентовОграничениеЗубов.Ссылка = ДоговорыКонтрагентовУслугиПоДоговору.Ссылка
	|			И ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки = ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовОграничениеЗубов.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	КлючСтроки ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(Договор), Договор, Объект.Ссылка));
	//Запрос.УстановитьПараметр("КлючСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ВыборкаКлючСтроки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
	Дерево.Строки.Очистить();
	
	Пока ВыборкаКлючСтроки.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаКлючСтроки.КлючСтроки) Тогда
			НоваяСтрЗубы = Дерево.Строки.Добавить(); 
			НоваяСтрЗубы.КлючСтрокиОграничениеЗубов = ВыборкаКлючСтроки.КлючСтроки;	
		КонецЕсли;
		
		Детали = ВыборкаКлючСтроки.Выбрать();
		
		Пока Детали.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Детали.Номенклатура) Тогда
				
				НовСтрДетали = НоваяСтрЗубы.Строки.Добавить();
				
				ЗаполнитьЗначенияСвойств(НовСтрДетали, Детали);
				НовСтрДетали.КлючСтрокиУслугиПоДоговору = Детали.КлючСтроки; 
				НовСтрДетали.Картинка = БиблиотекаКартинок.ИконкаЭлементДляСписка;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаКлючСтроки.КлючСтроки) Тогда
				// Заполняем главную группировку, т.к. данные тянутся позже.	
				НоваяСтрЗубы.КоличествоЗубов	 = Детали.КоличествоЗубов;
				НоваяСтрЗубы.КоличествоВПриеме	 = Детали.КоличествоВПриеме;	
				НоваяСтрЗубы.Номенклатура		 = Детали.НаименованиеОграничения; //ПолучитьПредставленеОграниченияЗуба(Детали.НаименованиеОграничения, Детали.КоличествоВПриеме, Детали.КоличествоЗубов);
				НоваяСтрЗубы.Картинка			 = БиблиотекаКартинок.ИконкаПапкиДляСписка;
				НоваяСтрЗубы.НаименованиеОграничения = Детали.НаименованиеОграничения;
				НоваяСтрЗубы.ПредставлениеОграничение = ПолучитьПредставлениеОграниченияЗуба(Детали.КоличествоВПриеме, Детали.КоличествоЗубов);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;		
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг");
	
КонецПроцедуры

&НаСервере
// Функция - возвращает наименование ограничения зубов в приеме.
//
Функция ПолучитьПредставлениеОграниченияЗуба(КоличествоВПриеме, КоличествоЗубов)
	
	СтрокаСЧисломЗубов = СтрокаСЧислом(";%1 зуб;;%1 зуба;%1 зубов;%1 зуба", КоличествоЗубов, ВидЧисловогоЗначения.Количественное, "L=ru"); 
	
	Если КоличествоВПриеме > 0 Тогда    
		СтрокаСЧисломПриемы	= СтрШаблон(", но не более %1 в приеме", КоличествоВПриеме);
	Иначе
		СтрокаСЧисломПриемы = "";
	КонецЕсли;

	Если КоличествоЗубов > 0 Тогда		
		Возврат СтрШаблон("На %1%2", СтрокаСЧисломЗубов, СтрокаСЧисломПриемы);
	Иначе		
		Возврат "";
	КонецЕсли; 
	
КонецФункции

&НаСервере
// Процедура - Дерево в таблицу.
//
Процедура ДеревоВТаблицу(ТекущийОбъект)
	
	Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
	
	ТекущийОбъект.ОграничениеЗубов.Очистить();
	ТекущийОбъект.УслугиПоДоговору.Очистить();
	
	ПреобразоватьДеревоВТаблицуРекурсивно(Дерево, ТекущийОбъект); 
	
	МассивВыбранныхНоменклатур = ПолучитьМассивВыбранныхНоменклатур();
	
	Для каждого ЭлементМассива Из МассивВыбранныхНоменклатур Цикл 
		СтрокаТабличнойЧасти = ТекущийОбъект.УслугиПоДоговору.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = ЭлементМассива;
		СтрокаТабличнойЧасти.Согласование = Перечисления.ТипыСогласованийУслугСтраховойКомпании.НеТребуется;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - преобрзует дерево значений формы в табличную часть объекта рекурсивно.
//
Процедура ПреобразоватьДеревоВТаблицуРекурсивно(КоллекцияСтрок, ТекущийОбъект)
	
	Для каждого СтрокаДерева Из КоллекцияСтрок.Строки Цикл
		
		Если ТипЗнч(СтрокаДерева.Номенклатура) = Тип("Строка") Тогда
			
			СтрокаТабличнойЧасти = ТекущийОбъект.ОграничениеЗубов.Добавить();  
			СтрокаТабличнойЧасти.НаименованиеОграничения = СтрокаДерева.НаименованиеОграничения;
			СтрокаТабличнойЧасти.КлючСтроки				 = СтрокаДерева.КлючСтрокиОграничениеЗубов;
			СтрокаТабличнойЧасти.КоличествоЗубов	 	 = СтрокаДерева.КоличествоЗубов;
			СтрокаТабличнойЧасти.КоличествоВПриеме	 	 = СтрокаДерева.КоличествоВПриеме;
			
		Иначе
			
			СтрокаТабличнойЧасти = ТекущийОбъект.УслугиПоДоговору.Добавить();
			СтрокаТабличнойЧасти.КлючСтроки				 = СтрокаДерева.КлючСтрокиУслугиПоДоговору;
			СтрокаТабличнойЧасти.Номенклатура			 = СтрокаДерева.Номенклатура;
			СтрокаТабличнойЧасти.Согласование			 = СтрокаДерева.Согласование;
			СтрокаТабличнойЧасти.Количество				 = СтрокаДерева.Количество;			  
			СтрокаТабличнойЧасти.КоличествоПриПревышении = СтрокаДерева.КоличествоПриПревышении; 
			
		КонецЕсли; 
		
		ПреобразоватьДеревоВТаблицуРекурсивно(СтрокаДерева, ТекущийОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить ограничение зубов на сервере завершение.
//
Процедура ДобавитьОграничениеЗубовНаСервереЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено
		И ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ИзменитьДеревоУслуг(Результат);
		РазвернутьДеревоЗначений();
		ЭтаФорма.Модифицированность = Истина; 
		УстановитьДоступностьДобавленияУслугНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Изменить дерево услуг.
//
Процедура ИзменитьДеревоУслуг(СтруктураПараметров = Неопределено)
	
	Если СтруктураПараметров <> Неопределено Тогда
		
		Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
		
		ПредставлениеОграниченияЗуба = ПолучитьПредставлениеОграниченияЗуба(СтруктураПараметров.КоличествоВПриеме, СтруктураПараметров.КоличествоЗубов);
		
		// Помним, что для Общих итогов задан свой УИД.
		// Для групп тоже задан УИД
		// Без УИДа могут быть только номенклатуры без групп. 
		НайденнаяСтрока = Дерево.Строки.Найти(СтруктураПараметров.КлючСтроки, "КлючСтрокиОграничениеЗубов"); // Ищем в общих итогах.
		Если НайденнаяСтрока <> Неопределено Тогда  
			
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтруктураПараметров); 
			НайденнаяСтрока.Номенклатура = СтруктураПараметров.НаименованиеОграничения; 
			НайденнаяСтрока.ПредставлениеОграничение = ПредставлениеОграниченияЗуба; 
			//НайденнаяСтрока.Номенклатура = НаименованиеОграниченияЗуба; 
			
		Иначе
			
			НовСтрДетали = Дерево.Строки.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрДетали, СтруктураПараметров); 
			НовСтрДетали.Номенклатура = СтруктураПараметров.НаименованиеОграничения; 
			НовСтрДетали.ПредставлениеОграничение = ПредставлениеОграниченияЗуба; 
			НовСтрДетали.КлючСтрокиОграничениеЗубов = СтруктураПараметров.КлючСтроки;
			НовСтрДетали.Картинка = БиблиотекаКартинок.ИконкаПапкиДляСписка;
			НовСтрДетали.Согласование = СтруктураПараметров.Согласование; 
			
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг"); 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Дерево услуги номенклатура начало выбора завершение.
//
Процедура ДеревоУслугиНоменклатураНачалоВыбораЗавершение(Значение, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли; 
	
	ДобавитьМассивНоменклатурНаСервере(Значение, Параметры);
	
	РазвернутьДеревоЗначений();
	
КонецПроцедуры

&НаКлиенте
// Процедура - разворачивает дерево значений на клиенте.
//
Процедура РазвернутьДеревоЗначений()
	
	тЭлементы = ДеревоУслуг.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДеревоУслуг.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - добавляет массив номенклатур в дерево услуг на сервере.
//
Процедура ДобавитьМассивНоменклатурНаСервере(МассивНоменклатур, МассивВыбранныхНоменклатур)
	
	ТекущаяСтрока = ДеревоУслуг.НайтиПоИдентификатору(Элементы.ДеревоУслуг.ТекущаяСтрока);
	СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
	
	Если ТекущаяСтрока.Номенклатура = Неопределено
		ИЛИ ТипЗнч(ТекущаяСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
		
	Иначе
		СтрокаРодитель = ТекущаяСтрока;	
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоУслуг"); 
	
	НайденнаяСтрокаРодитель = Дерево.Строки.Найти(СтрокаРодитель.КлючСтрокиОграничениеЗубов, "КлючСтрокиОграничениеЗубов", Истина); // Ищем в общих итогах.	
	
	Если НайденнаяСтрокаРодитель <> Неопределено Тогда
		Для каждого ЭлементМассива Из МассивНоменклатур Цикл 
			
			ДобавитьНоменклатуруРекурсивно(Дерево, НайденнаяСтрокаРодитель, ЭлементМассива, МассивВыбранныхНоменклатур);
			
		КонецЦикла;	
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг"); 
	
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаСервере
// Процедура - Добавить номенклатуру рекурсивно.
//
// Параметры:
//  Дерево					 - 	 - 
//  НайденнаяСтрокаРодитель	 - 	 - 
//  НоменклатураСсылка		 - 	 - 
//
Процедура ДобавитьНоменклатуруРекурсивно(Дерево, НайденнаяСтрокаРодитель, НоменклатураСсылка, МассивВыбранныхНоменклатур)
		
	// Добавляем группу.
	Если НоменклатураСсылка.ЭтоГруппа Тогда 
		
		ТаблицаНоменклатуры = Справочники.Номенклатура.ПолучитьНоменклатуруПоГруппе(НоменклатураСсылка);
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			ДобавитьНоменклатуруРекурсивно(Дерево, НайденнаяСтрокаРодитель, СтрокаТаблицы.Ссылка, МассивВыбранныхНоменклатур);
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(МассивВыбранныхНоменклатур) Тогда 
			// Исключаем не выбранные услуги.
			ИндексНайденнойСтроки = МассивВыбранныхНоменклатур.Найти(НоменклатураСсылка);
			
			Если ИндексНайденнойСтроки <> Неопределено Тогда
				
				// Добавляем элемент.
				НайденнаяСтрока = Дерево.Строки.Найти(НоменклатураСсылка, "Номенклатура", Истина);	
				Если НайденнаяСтрока = Неопределено Тогда
					
					НоваяСтрока = НайденнаяСтрокаРодитель.Строки.Добавить();
					НоваяСтрока.Номенклатура = НоменклатураСсылка;
					НоваяСтрока.Согласование = ?(ЗначениеЗаполнено(НайденнаяСтрокаРодитель.Согласование), НайденнаяСтрокаРодитель.Согласование, ПредопределенноеЗначение("Перечисление.ТипыСогласованийУслугСтраховойКомпании.НеТребуется")); 
					НоваяСтрока.Картинка	 = БиблиотекаКартинок.ИконкаЭлементДляСписка;
					НоваяСтрока.КлючСтрокиУслугиПоДоговору = НайденнаяСтрокаРодитель.КлючСтрокиОграничениеЗубов; 
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Заполнить дерево номенклатур.
//
Процедура ЗаполнитьДеревоНоменклатур(Договор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки КАК КлючСтроки,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВтДоговоров
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	НЕ ВтДоговоров.КлючСтроки ЕСТЬ NULL КАК Выбран,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	СпрНоменклатура.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДоговоров КАК ВтДоговоров
	|		ПО СпрНоменклатура.Ссылка = ВтДоговоров.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&ДатаСреза, ) КАК СтатусыНоменклатурыСрезПоследних
	|		ПО СпрНоменклатура.Ссылка = СтатусыНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НЕ СпрНоменклатура.ПометкаУдаления
	|	И ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА)
	|	И НЕ СпрНоменклатура.Ссылка В (&НеиспользуемыеГруппы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпрНоменклатура.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Договор", ?(ЗначениеЗаполнено(Договор), Договор, Объект.Ссылка));
	Запрос.УстановитьПараметр("УИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")); 
	Запрос.УстановитьПараметр("НеиспользуемыеГруппы", 
	Справочники.Номенклатура.ПолучитьНеиспользуемыеГруппы(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, ТекущаяДатаСеанса(), МассивТипов));
	
	ДеревоЗнч = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	
	ЗначениеВРеквизитФормы(ДеревоЗнч, "ДеревоНоменклатур");                                    

КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку флагов на элменеты.
//
Процедура УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки, МассивИсключений = Неопределено)
	
	МассивИсключений = ?(МассивИсключений = Неопределено, Новый Массив(), МассивИсключений);
	Флаг 		 = ТекущиеДанные[ИмяКолонки];
	ДанныеДерева = ТекущиеДанные.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		НайденнаяСтрока = МассивИсключений.Найти(СтрокаДерева.Номенклатура);
		Если НайденнаяСтрока = Неопределено Тогда
			СтрокаДерева[ИмяКолонки] = Флаг;
			
			Если СтрокаДерева.ЭтоГруппа Тогда
				УстановитьФлагиНаЭлементы(СтрокаДерева, ИмяКолонки, МассивИсключений);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Удалите услугу: %1 из дерева ограничений", СтрокаДерева.Номенклатура));	
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает флаги на группы.
//
Процедура УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, ЭтоРодитель = Ложь)
	
	Если ЭтоРодитель Тогда
		Родитель = ТекущиеДанные;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		Если СтрокаДерева[ИмяКолонки] = 1 Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		ИначеЕсли СтрокаДерева[ИмяКолонки] = 2 Тогда
			КоличествоВыбранных = -1;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонки] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонки] = 0;
	Иначе
		Родитель[ИмяКолонки] = 2;
	КонецЕсли;		
	
	УстановитьФлагиНаГруппы(Родитель, ИмяКолонки);
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает флаги на группы при первоночальном построение дерева.
//
Процедура УстановитьНачальныеФлагиНаГруппы()
	
	// Проставялем флаги на группах дерева.
	ДанныеДерева = ЭтаФорма.ДеревоНоменклатур.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ОбработкаТабличныхЧастейКлиент.УстановитьНачальныеФлагиНаГруппы(СтрокаТЧ, "Выбран");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, заново заполняет дерево с учетом существующих ограничений.
//
Процедура ИсключитьСтрокиНаСервере()
	
	ЗаполнитьДеревоНоменклатур(ЭтотОбъект.ОснованаяКопияСсылка);  
	УстановитьНачальныеФлагиНаГруппы();
		
КонецПроцедуры

 &НаКлиенте
// Процедура, отмечает услуги сотрудников.
//
Процедура ОтметитьУслуги(Установить, МассивНоменклатур = Неопределено)
	
	ДанныеДерева = ЭтаФорма.ДеревоНоменклатур.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		  
		Если СтрокаТЧ.ЭтоГруппа Тогда
			СтрокаТЧ.Выбран = Установить;	
			УстановитьФлагиНаЭлементы(СтрокаТЧ, "Выбран", МассивНоменклатур);
			УстановитьФлагиНаГруппы(СтрокаТЧ, "Выбран", Истина);
		Иначе
			Если СтрокаТЧ.Выбран <> Установить Тогда
				
				НайденнаяНоменклатура = МассивНоменклатур.Найти(СтрокаТЧ.Номенклатура);
				Если НайденнаяНоменклатура = Неопределено Тогда
					СтрокаТЧ.Выбран = Установить;
					УстановитьФлагиНаГруппы(СтрокаТЧ, "Выбран");
				Иначе 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Удалите услугу: %1 из дерева ограничений", СтрокаТЧ.Номенклатура));
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры
 
&НаСервере
// Функция - Получить список номенклатуры органичений.
//
Функция ПолучитьСписокНоменклатурыОрганичений()
	
	Возврат ВыгрузитьДеревоЗначенийВТаблицу(РеквизитФормыВЗначение("ДеревоУслуг"), Ложь).ВыгрузитьКолонку("Номенклатура");

КонецФункции

&НаСервере
// Процедура, устанвливает фильтр.
//
Процедура УстановитьФильтр()
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы[0];
	Если Фильтр = 1 Тогда
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Истина;
	Иначе
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает доступность кнопки добавления услуг на сервере.
//
Процедура УстановитьДоступностьДобавленияУслугНаСервере()

	Элементы.ДеревоУслуг_Добавить.Доступность = ДеревоУслуг.ПолучитьЭлементы().Количество() > 0;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает доступность кнопки добавления услуг на клиенте.
//
Процедура УстановитьДоступностьДобавленияУслугНаКлиенте()

	Элементы.ДеревоУслуг_Добавить.Доступность = ДеревоУслуг.ПолучитьЭлементы().Количество() > 0;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ПрограммаСтрахованияПриИзменении(Элемент)

	УстановитьВидимостьМеток();
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает видимость меток.
//
Процедура УстановитьВидимостьМеток()

	Если ЗначениеЗаполнено(Объект.ПрограммаСтрахования) Тогда
		Элементы.ГруппаПрограммаСтрахования.Видимость = Истина; 
	КонецЕсли;
	
	ДанныеПрограммыСтрахования = ДанныеПрограммыСтрахования(Объект.ПрограммаСтрахования); 
	
	Элементы.ДекорацияПрограммаСтрахования.Заголовок 	= ДанныеПрограммыСтрахования.Текст;
	Элементы.ДекорацияПрограммаСтрахования.ЦветТекста 	= ДанныеПрограммыСтрахования.ЦветТекста;
	Элементы.ГруппаПрограммаСтрахования.ЦветФона 		= ДанныеПрограммыСтрахования.ЦветФона;
	
КонецПроцедуры  

&НаСервереБезКонтекста
// Функция - Данные программы страхования.
//
// Параметры:
//  ПрограммаСтрахования - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДанныеПрограммыСтрахования(ПрограммаСтрахования)
	
	Возврат Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(ПрограммаСтрахования)
	
КонецФункции


#КонецОбласти
